KEYWORDS = "спасательная,безенги,кязи,казбек,альпинизм,альпинист,альпинисты,эльбрус,эльбрусе,гора,горы,горе,горой,гору,гор,горам,горами,горах,землетрясение,извержение,сопка,аннапурна,эверест,скалолаз,скалолазы,скалолазный,ачишхо,пещера,пещеры,спелеолог,спелеолога,лавина,лавине,лавины,лавину,лавиной,лавинная,лавин,лавины,перевал,лавинам,лавинами,лавинных,лавинах,лавиноопасный,лавиноопасная,Урубко"
EXCLUDED_KEYWORDS = "Абрамс"
PHRASES = "спасательная операция"
EXCLUDED_PHRASES = "гора мусора, поклонная гора, военная операция"
REQUEST_FREQUENCY = 60 * 5
CACHE_SIZE = 1000
ACCIDENT_THRESHOLD = 2