KEYWORDS = "спасательная,безенги,кязи,казбек,альпинизм,альпинист,альпинисты,эльбрус,эльбрусе,гора,горы,горе,горой,гору,гор,горам,горами,горах,землетрясение,извержение,сопка,аннапурна,эверест,скалолаз,скалолазы,скалолазный,ачишхо,пещера,пещеры,спелеолог,спелеолога,лавина,лавине,лавины,лавину,лавиной,лавинная,лавин,лавины,перевал,лавинам,лавинами,лавинных,лавинах,лавиноопасный,лавиноопасная,Урубко"
KEYWORDS_V2 = """
спасательный,безенги,кязи,казбек,альпинизм,альпинист,эльбрус,гора,землетрясение,извержение,сопка,аннапурна,эверест,
скалолаз,скалолазный,ачишхо,пещера,спелеолог,лавина,перевал,лавиноопасный,Урубко,пострадать,спасатель,гора, турист,
помощь, спасение, инцидент, эвакуировать, кавказ, туризм, маршрут, травма, мчс, упасть, тропа, пропасть, вершина, обнаружить, горный,
альпы, восхождение, спасти, лыжник, падение, спуститься, отряд, эвакуация, склон, пик, Гималаи, Тянь-Шань, Сванетия, Чаухи,
Уллу-Тау, Адылсу,Адырсу, Узункол, Ала-Арча, Туюк-Су, Пик Ленина, пик Победы, пик Корженевской, Хан-Тенгри, пик Коммунизма,
пик Исмоила Сомони, К2, Чогори, Лходзе, Шиша-Пангма, Шишапангма, Канченджанга, Манаслу, Макалу, Дхаулахири, Дхаулагири,
Гашербрум, Нангапарбат, Чо-Ойу, Броуд-пик 
"""
EXCLUDED_KEYWORDS = "Абрамс, учения, тренировка"
PHRASES = """спасательный операция, инцидент произойти, первый помощь, вызвать спасатель, спасатель команда,
спасательный отряд, спасатель поступить, оказать первый, пострадать эвакуировать, отряд спасатель, помощь отправиться, 
спустить вниз, сход лавина, результат падение, вызов спасатель, помощь вертолет, спасатель обнаружить, прибыть спасатель, 
эвакуировать вертолет, глубина падение, прибыль спасатель, причина инцидент, район гора, юрпсо мчс, время восхождение,
поисковоспасательный отряд, упасть высота, оказать первый помощь, вызов спасатель поступить, глубина падение составить,
падение составить около, оказание первый помощь, инцидент произойти около, помочь спуститься вниз, помощь альпинистский снаряжение,
инцидент произойти район, пострадать оказать первый, пострадать первый помощь, отправиться отряд спасатель, оказать пострадать первый, 
помощь прибыль спасатель, потерять равновесие упасть, упасть высота около, получить травма нога, помощь отправиться отряд, 
место происшествия прибыль
"""
EXCLUDED_PHRASES = "гора мусора, поклонная гора, военная операция"
REQUEST_FREQUENCY = 60 * 5
CACHE_SIZE = 1000
ACCIDENT_THRESHOLD = 2